{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, memory submission/editing, and memory retrieval with role checks.",
  "feature_evidence.json": "Report documenting a redeploy-only feature with associated files, components, and test ID.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing major frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base and theme variable definitions with light/dark mode OKLCH color tokens and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/REDEPLOY.md": "Non-functional marker file used to trigger a fresh deployment and provide troubleshooting guidance.",
  "frontend/src/App.tsx": "Root React component handling password/welcome gates, chat mode routing, memory filtering, and main UI layout.",
  "frontend/src/components/ChatFullPage.tsx": "Full-screen chat page with header, chat card container, and footer; removes view param on close.",
  "frontend/src/components/ChatView.tsx": "Interactive chat view supporting name setup, message submission, auto-scroll, and single/bulk delete actions.",
  "frontend/src/components/ChatWidget.tsx": "Floating chat launcher opening chat in a new tab, with an optional in-page chat panel toggle.",
  "frontend/src/components/MemoryEditDialog.tsx": "Dialog for editing an existing memory with validation for text and media uploads.",
  "frontend/src/components/MemoryFullscreenViewer.tsx": "Fullscreen dialog showing detailed memory content with access control and edit permissions.",
  "frontend/src/components/MemoryList.tsx": "Renders a list of memories with cards supporting view, media preview, and optional editing.",
  "frontend/src/components/MemorySubmitForm.tsx": "Form for submitting a new memory with text, author, and image/video upload validation.",
  "frontend/src/components/MusicBoxWidget.tsx": "Floating widget for uploading and playing audio files with size checks and playback controls.",
  "frontend/src/components/PasswordGate.tsx": "A login gate component collecting username and 4‑digit code with validation and error handling.",
  "frontend/src/components/PidduWidget.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/TingiWidget.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/VideoViewer.tsx": "Modal video viewer that displays a video and shows an error alert if loading fails.",
  "frontend/src/components/WelcomePage.tsx": "A welcome screen with hero image and buttons to continue or lock the app.",
  "frontend/src/components/YouTubeLinksDialog.tsx": "Dialog for submitting and viewing YouTube links with validation and mutation handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useChat.ts": "Hooks for fetching, submitting, and deleting chat messages using the backend actor and react-query.",
  "frontend/src/hooks/useChatDisplayName.ts": "Manages chat display name with session and local storage persistence and validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hooks for managing Internet Identity login state, loading stored identities, and exposing auth functions.",
  "frontend/src/hooks/useMemories.ts": "Provides React Query hooks to fetch, submit, and edit memories using a backend actor, with automatic cache invalidation.",
  "frontend/src/hooks/usePasswordGate.ts": "Implements a username/password gate using session and local storage to persist unlock state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that old Tingi search code was removed.",
  "frontend/src/hooks/useSongs.ts": "Adds hooks to load and upload songs through the backend actor, sorting by newest and refreshing cache on upload.",
  "frontend/src/hooks/useSubmitterCredential.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useTingiConfig.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useWelcomeGate.ts": "Manages a dismissible welcome gate using session storage with reset and dismiss functions.",
  "frontend/src/hooks/useYouTubeLinks.ts": "Hooks for fetching and submitting YouTube links, sorted by timestamp, with cache invalidation on submit.",
  "frontend/src/index.css": "Tailwind base styles plus custom color variables, typography, and scrollbar styling for light and dark themes.",
  "frontend/src/lib/audio.ts": "Utility functions to convert audio files to Uint8Array and create data URLs with guessed MIME types.",
  "frontend/src/lib/format.ts": "Formats bigint nanosecond timestamps into human-readable date or time strings.",
  "frontend/src/lib/googleCustomSearch.ts": "Empty placeholder library file.",
  "frontend/src/lib/pidduDeterministic.ts": "Empty placeholder library file.",
  "frontend/src/lib/tingiHumor.ts": "Empty placeholder library file.",
  "frontend/src/main.tsx": "Entry point rendering the app with React Query and Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines the current project state, including chat enhancements, UI rules, memory permissions, and known issues. Lists architectural notes and existing features for development planning."
}