{
  "backend/main.mo": "Motoko backend storing memories in a Map with submit, get by id, and list-all APIs; assigns sequential IDs and timestamps using Time.now.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components for build verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind base and theme variables defining light/dark mode color tokens and shared styling.",
  "frontend/index.html": "Basic HTML entry point providing root container and loading the Vite/React main script.",
  "frontend/src/App.tsx": "Main app flow controlling password gate, welcome page, memory features, and rendering PidduWidget after unlock/dismiss.",
  "frontend/src/components/MemoryList.tsx": "Renders memory cards with author, timestamp, text, and optional media with fallback handling and video modal support.",
  "frontend/src/components/MemorySubmitForm.tsx": "Form for creating memories with text, author, and image/video inputs including validation, previews, and submit mutation.",
  "frontend/src/components/PasswordGate.tsx": "UI component for entering and validating a 4‑digit access code with error handling.",
  "frontend/src/components/PidduWidget.tsx": "Floating chat widget providing deterministic assistant responses with message history and dialog UI.",
  "frontend/src/components/TingiWidget.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/VideoViewer.tsx": "Modal video viewer that plays a provided video URL and shows an error alert if playback fails.",
  "frontend/src/components/WelcomePage.tsx": "Landing page displaying welcome content and actions to enter or lock the memory book.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and auth state.",
  "frontend/src/hooks/useMemories.ts": "Hooks for fetching sorted memories from the backend and submitting new memory entries.",
  "frontend/src/hooks/usePasswordGate.ts": "Hook managing a simple session‑stored 4‑digit password gate for unlocking and locking access.",
  "frontend/src/hooks/useQueries.ts": "Stub file noting removal of previous Tingi search code.",
  "frontend/src/hooks/useTingiConfig.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useWelcomeGate.ts": "Hook controlling whether the welcome page is dismissed using session storage.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables and base styling for light and dark modes.",
  "frontend/src/lib/format.ts": "Utility that formats bigint nanosecond timestamps into readable date strings.",
  "frontend/src/lib/googleCustomSearch.ts": "Empty placeholder file with no implementation.",
  "frontend/src/lib/pidduDeterministic.ts": "Defines deterministic keyword-based response patterns for the Piddu assistant with preset phrases and no external calls.",
  "frontend/src/lib/tingiHumor.ts": "Empty placeholder module for humor-related logic.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the main App component.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, plugins, colors, animations, and layout settings.",
  "project_state.json": "Captures the project’s current state, features, architecture notes, and description of the Rapunzel memory website and Piddu bot."
}