{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles and a public memories system with create, edit, and retrieval APIs.",
  "feature_evidence.json": "Structured report mapping implemented features to related frontend files, components, and test IDs for project verification.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose in the memory book, chat system, and UI hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark themes, and global background/foreground styles.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into the root div and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component handling password/unlock workflow, welcome screen, memory filtering, and routing into full‑page chat mode.",
  "frontend/src/components/ChatFullPage.tsx": "Standalone full‑page chat UI with header, close button, and embedded ChatView wrapped in styled layout components.",
  "frontend/src/components/ChatView.tsx": "Renders the main chat interface with message display, sending, name handling, and delete (single/bulk) functionality.",
  "frontend/src/components/ChatWidget.tsx": "Provides a floating chat launcher that opens chat in a new tab and an optional in-page chat panel using ChatView.",
  "frontend/src/components/MemoryEditDialog.tsx": "Dialog for editing an existing memory with text, media upload/URL handling, validation, and submission.",
  "frontend/src/components/MemoryFullscreenViewer.tsx": "Displays a memory in a full-screen dialog with metadata, media, access restrictions, and optional edit support.",
  "frontend/src/components/MemoryList.tsx": "Lists memories and renders each in a card with metadata, media previews, fullscreen view, and conditional editing.",
  "frontend/src/components/MemorySubmitForm.tsx": "Form for submitting new memories with text, author, optional media uploads or URLs, validation, and previewing.",
  "frontend/src/components/MusicBoxWidget.tsx": "Audio upload and playback widget allowing file validation, upload, and in-browser playback of stored songs.",
  "frontend/src/components/PasswordGate.tsx": "Username and 4‑digit code gate that validates input and calls an unlock handler.",
  "frontend/src/components/PidduWidget.tsx": "Empty placeholder component file.",
  "frontend/src/components/TingiWidget.tsx": "Empty placeholder component file.",
  "frontend/src/components/VideoViewer.tsx": "Dialog component that displays a video with error handling when the file cannot be loaded.",
  "frontend/src/components/WelcomePage.tsx": "Landing page with welcome text, hero image, and buttons to continue or lock the app.",
  "frontend/src/components/YouTubeLinksDialog.tsx": "Dialog for submitting and listing YouTube links with URL validation and backend integration.",
  "frontend/src/hooks/useActor.ts": "React hook to create and manage a backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useChat.ts": "Chat hooks for fetching, submitting, and deleting messages via the backend with polling and cache invalidation.",
  "frontend/src/hooks/useChatDisplayName.ts": "Manages chat display name persisted in session and local storage with helpers to set and clear it.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useMemories.ts": "Fetches, sorts, and mutates memory entries via backend actor with React Query.",
  "frontend/src/hooks/usePasswordGate.ts": "Implements a username/password gate with session and local storage persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting removal of Tingi search code.",
  "frontend/src/hooks/useSongs.ts": "Loads and sorts songs from the backend and handles uploading new songs using React Query.",
  "frontend/src/hooks/useSubmitterCredential.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useTingiConfig.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useWelcomeGate.ts": "Handles a dismissible welcome gate using session storage.",
  "frontend/src/hooks/useYouTubeLinks.ts": "Fetches, sorts, and submits YouTube links via backend actor with React Query.",
  "frontend/src/index.css": "Defines Tailwind layers and custom theming variables plus scrollbar styling.",
  "frontend/src/lib/audio.ts": "Provides utilities for converting audio files to/from Uint8Array and generating data URLs.",
  "frontend/src/lib/format.ts": "Formats bigint timestamps into readable date or time strings.",
  "frontend/src/lib/googleCustomSearch.ts": "Empty file with no implementation.",
  "frontend/src/lib/pidduDeterministic.ts": "Empty file with no implementation.",
  "frontend/src/lib/tingiHumor.ts": "Empty file with no implementation.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom color tokens, typography/container/animation plugins, and extended theme settings for layout, colors, fonts, and animations.",
  "project_state.json": "Defines the current project state, feature set, architectural notes, and known issues for a memory-sharing site with chat, password gating, and media-upload features."
}