{
  "backend/main.mo": "Implements access‑controlled user profiles and a public memories system with create, edit, read, and list operations backed by Maps.",
  "backend/migration.mo": "Defines persistent canister state types and returns the state unchanged for migrations.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten descriptive summaries for numerous frontend files used in build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and applying global theme styles.",
  "frontend/index.html": "Minimal HTML entry point that loads the React app from main.tsx into the root div.",
  "frontend/REDEPLOY.md": "Non-functional marker file used to trigger a redeploy and document deployment troubleshooting steps.",
  "frontend/src/App.tsx": "Main React component handling password and welcome gates, chat-view routing, memory filtering, and page layout.",
  "frontend/src/components/ChatFullPage.tsx": "Standalone full-page chat view with header, message list, close button, and themed layout.",
  "frontend/src/components/ChatView.tsx": "Provides a full chat interface with message submission, display name handling, auto-scroll, single and bulk delete, and message owner checks.",
  "frontend/src/components/ChatWidget.tsx": "Implements a floating chat launcher that opens chat in a new tab or an optional in-page chat panel using ChatView.",
  "frontend/src/components/MemoryEditDialog.tsx": "A dialog for editing an existing memory with validation, file upload handling, previews, and permission checks.",
  "frontend/src/components/MemoryFullscreenViewer.tsx": "Displays a memory in a fullscreen modal with metadata, media, view permissions, and an edit option if allowed.",
  "frontend/src/components/MemoryList.tsx": "Renders a list of memories, each as a card with metadata, media previews, view and edit access, and fullscreen or edit dialogs.",
  "frontend/src/components/MemorySubmitForm.tsx": "Form for submitting new memories with text, author, optional media uploads or URLs, validation, previews, and success feedback.",
  "frontend/src/components/MusicBoxWidget.tsx": "Provides a UI for uploading, validating, and playing audio files, including local file handling and playback control for stored songs.",
  "frontend/src/components/PasswordGate.tsx": "Renders a username and 4‑digit code login form with validation and error handling to gate access to protected content.",
  "frontend/src/components/PidduWidget.tsx": "Empty file containing no implementation.",
  "frontend/src/components/TingiWidget.tsx": "Empty file containing no implementation.",
  "frontend/src/components/VideoViewer.tsx": "Displays a modal video player with error fallback handling when a video fails to load or play.",
  "frontend/src/components/WelcomePage.tsx": "Shows a styled welcome screen with images and text, offering buttons to continue or lock the app.",
  "frontend/src/components/YouTubeLinksDialog.tsx": "Provides a dialog for submitting YouTube links with validation, listing existing links, and handling submission states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on authentication state, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useChat.ts": "Implements hooks for fetching, submitting, and deleting chat messages using the backend actor with polling and cache invalidation.",
  "frontend/src/hooks/useChatDisplayName.ts": "Manages a persistent chat display name across session and local storage with utilities for setting, validating, and clearing it.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state, login, logout, and loaded identities.",
  "frontend/src/hooks/useLockScreenRotation.ts": "Empty file.",
  "frontend/src/hooks/useMemories.ts": "Defines React Query hooks to fetch, submit, and edit memories using the backend actor.",
  "frontend/src/hooks/usePasswordGate.ts": "Implements a username/password gate with persistence in session and local storage.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting removal of old Tingi search logic.",
  "frontend/src/hooks/useSongs.ts": "React Query hooks for listing songs and uploading new songs through the backend actor.",
  "frontend/src/hooks/useSubmitterCredential.ts": "Empty file.",
  "frontend/src/hooks/useTingiConfig.ts": "Empty file.",
  "frontend/src/hooks/useWelcomeGate.ts": "Controls a dismissible welcome screen using session storage state.",
  "frontend/src/hooks/useYouTubeLinks.ts": "Provides hooks to fetch and submit YouTube links via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, themes, fonts, and scrollbar styling.",
  "frontend/src/lib/audio.ts": "Utilities to convert files to Uint8Array and to create audio data URLs with MIME guessing.",
  "frontend/src/lib/format.ts": "Formats bigint timestamps into readable date or time strings.",
  "frontend/src/lib/googleCustomSearch.ts": "Empty file.",
  "frontend/src/lib/lockBackgrounds.ts": "Provides a static lock screen background configuration and helpers.",
  "frontend/src/lib/lockPhrases.ts": "Provides a static lock screen phrase and helper accessors.",
  "frontend/src/lib/pidduDeterministic.ts": "Empty file.",
  "frontend/src/lib/tingiHumor.ts": "Empty file.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers, then rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session keys.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and integrates typography, container queries, and animation plugins.",
  "project_state.json": "Defines project rollback to Version 21 and tracks issues and feature requests related to memory and chat write persistence."
}