{
  "backend/main.mo": "Motoko actor storing memories with auto-incremented IDs, providing submit, get, and list endpoints with basic validation.",
  "feature_evidence.json": "Feature evidence report mapping Tingi-related features to their impacted files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file for build reference.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark modes and global element styling.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Main app flow controlling password gate, welcome screen, memory submission/list views, and Tingi widget visibility.",
  "frontend/src/components/MemoryList.tsx": "Lists memory cards with text, author, timestamps, images, and video viewer support with error handling.",
  "frontend/src/components/MemorySubmitForm.tsx": "Form component for submitting memories with text, author, image/video URLs or uploads, including validation and preview handling.",
  "frontend/src/components/PasswordGate.tsx": "Four‑digit password gate UI that validates input and triggers unlock logic with error handling.",
  "frontend/src/components/TingiWidget.tsx": "Floating search assistant widget that configures API keys, handles Google search requests, and displays humorous chat responses.",
  "frontend/src/components/VideoViewer.tsx": "Modal video viewer that plays a video URL and shows an error alert if playback fails.",
  "frontend/src/components/WelcomePage.tsx": "Landing page with hero image and intro text, offering buttons to enter the memory book or lock it.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication state, login, logout, and loading stored identities.",
  "frontend/src/hooks/useMemories.ts": "Hooks for fetching sorted memories and submitting new ones through the backend actor, with React Query integration.",
  "frontend/src/hooks/usePasswordGate.ts": "Implements a session‑stored 4‑digit password gate with unlock and lock helpers.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook kept for future query-related code.",
  "frontend/src/hooks/useTingiConfig.ts": "Manages loading and saving Google Custom Search API config in localStorage.",
  "frontend/src/hooks/useWelcomeGate.ts": "Tracks whether the welcome screen has been dismissed using session storage.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm theme using OKLCH CSS variables with light/dark modes.",
  "frontend/src/lib/format.ts": "Formats bigint nanosecond timestamps into readable date strings.",
  "frontend/src/lib/googleCustomSearch.ts": "Calls Google Custom Search API with validation and maps responses to simple result objects.",
  "frontend/src/lib/tingiHumor.ts": "Generates playful greetings, summaries, and error messages for Tingi using search results.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and theme variables.",
  "project_state.json": "Describes overall project state, features, and requirements for the Rapunzel memories site."
}