{
  "backend/main.mo": "Motoko canister managing memories, songs, and YouTube links with CRUD operations, submitter-based permissions, and timestamping.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, hooks, utilities, and styling files.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and applying global background, text, and border styles.",
  "frontend/index.html": "Root HTML page that mounts the React app and loads main.tsx as the entry script.",
  "frontend/src/App.tsx": "Main React application controlling password gate, welcome flow, memory filtering by role, and overall UI layout including media widgets.",
  "frontend/src/components/MemoryEditDialog.tsx": "Dialog for editing existing memories with validation, file handling, previews, and permission checks before submitting updates.",
  "frontend/src/components/MemoryFullscreenViewer.tsx": "Displays a full-screen modal for viewing a memory with permission checks, media rendering, and optional editing.",
  "frontend/src/components/MemoryList.tsx": "Renders a list of memory cards with metadata, media previews, fullscreen view, and edit controls.",
  "frontend/src/components/MemorySubmitForm.tsx": "Form for submitting new memories with validation, image/video upload support, and preview handling.",
  "frontend/src/components/MusicBoxWidget.tsx": "Widget for uploading, listing, and playing audio files with validation and audio playback management.",
  "frontend/src/components/PasswordGate.tsx": "A login gate that verifies username and 4‑digit access code before unlocking protected content.",
  "frontend/src/components/PidduWidget.tsx": "Empty placeholder component file.",
  "frontend/src/components/TingiWidget.tsx": "Empty placeholder component file.",
  "frontend/src/components/VideoViewer.tsx": "Modal video viewer that plays a memory’s video and handles playback errors gracefully.",
  "frontend/src/components/WelcomePage.tsx": "A React welcome screen showing themed imagery and text with buttons to continue or lock the app.",
  "frontend/src/components/YouTubeLinksDialog.tsx": "A dialog for submitting and viewing YouTube links with validation, error handling, and a list of saved links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and logic using Internet Identity, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useMemories.ts": "Fetches, submits, and edits memory entries via the backend actor with react-query caching.",
  "frontend/src/hooks/usePasswordGate.ts": "Implements a simple username/password gate using sessionStorage and exposes unlock/lock state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that previous Tingi search code was removed.",
  "frontend/src/hooks/useSongs.ts": "Fetches and uploads songs through the backend actor and keeps the song list updated via react-query.",
  "frontend/src/hooks/useSubmitterCredential.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useTingiConfig.ts": "Empty placeholder hook.",
  "frontend/src/hooks/useWelcomeGate.ts": "Tracks whether the welcome screen was dismissed using sessionStorage and exposes reset/dismiss actions.",
  "frontend/src/hooks/useYouTubeLinks.ts": "Fetches and submits YouTube links via the backend actor, sorting by timestamp and refreshing on updates.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom light/dark color palette for the app’s theme.",
  "frontend/src/lib/audio.ts": "Provides utilities to convert files to Uint8Array and back to data URLs with MIME type guessing.",
  "frontend/src/lib/format.ts": "Formats bigint nanosecond timestamps into readable date-time strings.",
  "frontend/src/lib/googleCustomSearch.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/lib/pidduDeterministic.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/lib/tingiHumor.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/main.tsx": "React entry point that mounts the app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, themes, animations, and plugins.",
  "project_state.json": "Project state metadata describing features, requirements, access rules, and architectural notes."
}