{
  "kind": "build_request",
  "title": "Require username + 4-digit code on lock screen (allow tingi99 or meow99)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-54",
      "text": "Update the lock screen (PasswordGate) UI to include a username input section positioned above the existing 4-digit PIN input, and use clear English labels and helper text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "require entering a username + the existing 4‑digit code",
          "both usernames (tingi99 and meow99) be accepted",
          "above the PIN input"
        ]
      },
      "acceptanceCriteria": [
        "The lock screen displays a new \"Username\" input field above the existing \"Access Code\" (PIN) field.",
        "All user-facing text in the lock screen remains in English and matches the site’s warm visual theme (Tailwind + shadcn).",
        "The username field accepts free-typed text (not numeric-only), while the access code field remains numeric-only and limited to 4 digits."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Change the lock/unlock validation so the site unlocks only when the visitor enters an allowed username (exactly \"tingi99\" or \"meow99\") AND the existing 4-digit code (exactly \"5699\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "require entering a username + the existing 4‑digit code",
          "both usernames (tingi99 and meow99) be accepted"
        ]
      },
      "acceptanceCriteria": [
        "Entering username \"tingi99\" with access code \"5699\" unlocks the site.",
        "Entering username \"meow99\" with access code \"5699\" unlocks the site.",
        "Any other username value does not unlock the site, even if the code is correct.",
        "Any incorrect code does not unlock the site, even if the username is one of the allowed values.",
        "Error messaging is shown in English and clearly distinguishes invalid credentials (e.g., \"Incorrect username or code. Please try again.\") without revealing any new secrets beyond the allowed usernames already specified by the user."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Persist the unlocked state for the current browser session only when BOTH username + code are valid, and ensure the existing \"Lock\" action fully re-locks the site so the username+code screen is shown again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "require entering a username + the existing 4‑digit code"
        ]
      },
      "acceptanceCriteria": [
        "After a successful unlock with a valid username + \"5699\", refreshing the page during the same browser session does not re-prompt for credentials (same behavior as before, now gated by both fields).",
        "Clicking the existing \"Lock\" button returns the visitor to the username+code gate and clears the session’s unlocked state so a refresh shows the gate again.",
        "No backend changes are required for this persistence behavior (session-only browser storage remains the mechanism)."
      ]
    }
  ],
  "constraints": [
    "Do not add any UI that allows visitors to configure or change the required username list or the 4-digit code; allowed usernames must be exactly \"tingi99\" and \"meow99\" and the code must remain exactly \"5699\".",
    "Do not modify files under frontend/src/components/ui or any other immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding Internet Identity or any other authentication system.",
    "Storing usernames persistently beyond the current browser session.",
    "Changing the welcome page flow or any post-unlock features (memories, music box, YouTube links).",
    "Any backend canister changes or migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}