{
  "kind": "build_request",
  "title": "Replace Tingi with Piddu deterministic bot (no search/backend)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Remove the existing Tingi search assistant experience and replace it with a new bottom-right floating helper widget named “Piddu” that simulates a ChatGPT-style chat experience using deterministic/scripted behavior only, with a fully new UI look.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Can remove Tingi and add a new bot like chat gpt in place of it and name it piddu",
          "Simulated and deterministic bot",
          "No \nYes"
        ]
      },
      "acceptanceCriteria": [
        "The main memories experience (after password gate + welcome page dismissal) shows a floating bottom-right launcher for “Piddu”.",
        "The widget’s visible name is “Piddu” (not “Tingi”) in the launcher aria-labels, dialog header/title, and any empty/welcome text.",
        "Piddu’s UI styling/layout is clearly different from the existing TingiWidget look (new visual design while still matching the site’s warm theme and shadcn/Tailwind patterns).",
        "All user-facing text in the Piddu widget is in English and does not reference Google, chrome.com, or searching.",
        "The widget supports: open/close, message history, user input, send action, and a loading state before showing a deterministic response."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Implement Piddu’s responses entirely on the frontend using deterministic logic (no LLM calls, no external APIs, and no backend calls).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Simulated and deterministic bot",
          "No"
        ]
      },
      "acceptanceCriteria": [
        "Submitting a message never triggers network requests for search/summarization (no calls to backend search endpoints and no calls to Google Custom Search).",
        "Piddu returns responses generated from deterministic/scripted templates (e.g., pattern-based replies) and consistently works offline once the app is loaded.",
        "The UI shows an in-progress/loading indicator between send and response, even though the response is deterministic."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Remove Tingi search wiring from the frontend, including the React Query mutation hook and any unused Tingi configuration/search helper modules, so the build contains no active Tingi search flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "No"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/components/TingiWidget.tsx is removed or replaced such that it no longer imports or uses useTingiSearch and no longer renders Tingi branding or search-related UI.",
        "frontend/src/hooks/useQueries.ts no longer exports useTingiSearch and is updated/cleaned up to avoid dead code related to Tingi search.",
        "frontend/src/hooks/useTingiConfig.ts is removed or updated so it is not referenced by the UI (and no longer mentions backend Google Custom Search credential handling).",
        "The frontend compiles without references to Tingi search types (e.g., TingiResponse) and without unused/empty placeholder search/humor modules being required at runtime."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Remove the Tingi Google Custom Search backend API and HTTP outcall logic from the Motoko canister so the backend provides no search/summarizing functionality for the helper bot.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "No"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo no longer exposes performTingiSearch or any TingiResponse type used for Google Custom Search results.",
        "backend/main.mo removes the Google Custom Search API key and CX usage from executable code paths.",
        "If the HTTP outcall transform helper becomes unused after removing search, it is removed as well (or left only if required elsewhere).",
        "The canister still builds and the memories APIs (submitMemory/getMemory/getAllMemories) continue to work as before."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Update the app shell to render the new Piddu widget (instead of TingiWidget) only in the main memories experience (after the visitor unlocks with the 4-digit code and dismisses the welcome page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10"
        ],
        "quotes": [
          "Yes",
          "No \nYes"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/App.tsx no longer imports/renders TingiWidget and instead imports/renders the new Piddu widget at the same gating point (unlocked + welcome dismissed).",
        "Piddu is not visible on the password gate screen or the welcome page screen.",
        "The rest of the site layout (header, hero, submission form, memory list, footer) remains unchanged aside from the widget swap."
      ]
    }
  ],
  "constraints": [
    "Do not integrate any real LLM provider (OpenAI/ChatGPT/Anthropic/etc.); Piddu must be simulated/deterministic only.",
    "Do not add any UI that allows visitors to view, edit, or store any API credentials.",
    "Respect frontend immutable paths listed in SYSTEM_CONTEXT (do not modify those files).",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if state schema changes (not expected for this change)."
  ],
  "nonGoals": [
    "Implementing real ChatGPT-style AI or calling any external LLM services.",
    "Adding real-time communication (WebSockets) or multi-user chat.",
    "Adding/keeping Google Custom Search functionality or any search-based summarization for the bot."
  ],
  "imageRequirements": {
    "required": [
      "Rounded friendly mascot icon illustration (piddu-icon.dim_128x128.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}