{
  "kind": "build_request",
  "title": "Restrict memory visibility and editing by unlock username (tingi99 vs meow99)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-62",
      "text": "Persist the successfully-unlocked username (\"tingi99\" or \"meow99\") in sessionStorage and expose it via the existing password-gate state so the rest of the UI can determine which unlock role is active; ensure the stored username is cleared when the visitor uses the existing Lock action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "Create a system in which only the visitor who enters tingi99 I able to see all the memories and those who enters meow99 can only see and edit their own response",
          "Persist the unlocked state for the current browser session only when BOTH username + code are valid, and ensure the existing \"Lock\" action fully re-locks the site so the username+code screen is shown again."
        ]
      },
      "acceptanceCriteria": [
        "After a successful unlock, refreshing the page during the same browser session keeps the user unlocked AND retains which username was used to unlock.",
        "Clicking the existing \"Lock\" action re-locks the site and removes the stored unlocked flag and the stored unlocked username from sessionStorage.",
        "No new UI is added for configuring roles; the role is derived only from the username entered on the existing PasswordGate screen."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Apply username-based memory visibility rules only to the Memories list and the Memory full-screen viewer: when unlocked as \"tingi99\", show all memories; when unlocked as \"meow99\", show only memories submitted by the current visitor (i.e., memories whose submitter Principal matches the currently active Internet Identity Principal used by the frontend actor/identity).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10"
        ],
        "quotes": [
          "Create a system in which only the visitor who enters tingi99 I able to see all the memories and those who enters meow99 can only see and edit their own response",
          "Only on memory and memory editing"
        ]
      },
      "acceptanceCriteria": [
        "When unlocked as \"tingi99\", the Memories count and list include all stored memories returned by the backend.",
        "When unlocked as \"meow99\", the Memories list renders only memories whose `memory.submitter` matches the current `identity.getPrincipal()` value.",
        "When unlocked as \"meow99\" and the visitor has no matching memories, show the existing empty-state layout but with user-facing text in English explaining that only their own memories are visible under meow99.",
        "The YouTube links feature and Music Box feature remain unchanged and still show shared lists as they do now (no username-based filtering is applied there)."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Enforce username-based memory editing rules only within the memory editing experience: when unlocked as \"tingi99\", keep the existing rule that only the original submitter can edit; when unlocked as \"meow99\", allow editing only for memories that are both (a) visible under the meow99 filter and (b) authored by the current Internet Identity Principal (do not allow editing any other memory).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10"
        ],
        "quotes": [
          "Create a system in which only the visitor who enters tingi99 I able to see all the memories and those who enters meow99 can only see and edit their own response",
          "Only on memory and memory editing"
        ]
      },
      "acceptanceCriteria": [
        "When unlocked as \"tingi99\", the current edit enable/disable behavior remains unchanged: edit is enabled only when `memory.submitter` matches the current Internet Identity principal.",
        "When unlocked as \"meow99\", edit controls are only available for memories that pass the meow99 visibility filter and match the current Internet Identity principal (no UI path allows editing any other memory).",
        "No changes are made to backend edit authorization logic; backend still rejects edits when the caller is not the original submitter."
      ]
    }
  ],
  "constraints": [
    "Apply the new username-based restriction ONLY to memory viewing (list + full-screen viewer) and memory editing, not to any other sections/features.",
    "Do not modify any files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not add new authentication methods beyond the existing PasswordGate + Internet Identity integration already present in the project.",
    "Do not change how songs (Music Box) are listed/visible; they remain shared among visitors.",
    "Do not change how YouTube links are listed/visible; they remain shared among visitors.",
    "Do not add any admin UI or role management UI beyond typing the username on the lock screen."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}