{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace Tingi with deterministic Piddu helper widget (frontend-only)",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Replace the Tingi assistant UI with a new bottom-right floating “Piddu” widget featuring a new chat-style look, history, input, send, open/close, and loading state.",
      "acceptanceCriteria": [
        "The main memories experience (after password gate + welcome page dismissal) shows a floating bottom-right launcher for “Piddu”.",
        "The widget’s visible name is “Piddu” (not “Tingi”) in the launcher aria-labels, dialog header/title, and any empty/welcome text.",
        "Piddu’s UI styling/layout is clearly different from the existing TingiWidget look (new visual design while still matching the site’s warm theme and shadcn/Tailwind patterns).",
        "All user-facing text in the Piddu widget is in English and does not reference Google, chrome.com, or searching.",
        "The widget supports: open/close, message history, user input, send action, and a loading state before showing a deterministic response."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PidduWidget.tsx",
          "operation": "create",
          "description": "Create a new floating bottom-right “Piddu” chat widget with a new visual design (distinct from TingiWidget) using shadcn-ui dialog/input/button/scroll-area patterns and Tailwind styling. Include: launcher button with aria-label naming “Piddu”, modal header/title “Piddu”, empty/welcome state text in English, message history rendering (user vs Piddu), open/close behavior, send action, and a visible loading indicator shown between send and response. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/public/assets/generated/piddu-icon.dim_128x128.png",
          "operation": "create",
          "description": "Add the generated rounded friendly mascot icon illustration asset at frontend/public/assets/generated/piddu-icon.dim_128x128.png and ensure PidduWidget references this exact file for the launcher and header icon."
        },
        {
          "path": "frontend/src/components/TingiWidget.tsx",
          "operation": "delete",
          "description": "Remove the existing Tingi widget UI implementation so it cannot be rendered or referenced by the app."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Implement deterministic, fully-frontend Piddu responses with no external APIs, no LLM calls, and no backend calls, while still showing a loading state.",
      "acceptanceCriteria": [
        "Submitting a message never triggers network requests for search/summarization (no calls to backend search endpoints and no calls to Google Custom Search).",
        "Piddu returns responses generated from deterministic/scripted templates (e.g., pattern-based replies) and consistently works offline once the app is loaded.",
        "The UI shows an in-progress/loading indicator between send and response, even though the response is deterministic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/pidduDeterministic.ts",
          "operation": "create",
          "description": "Implement deterministic/scripted response generation utilities for Piddu (pattern-based matching + fallback replies) with no network usage. Export a small API that the PidduWidget can call to produce replies consistently offline."
        },
        {
          "path": "frontend/src/components/PidduWidget.tsx",
          "operation": "modify",
          "description": "Wire the deterministic response generator into the widget: on send, append the user message, display a loading/in-progress message/state, then after a short timeout replace it with the deterministic Piddu reply from frontend/src/lib/pidduDeterministic.ts. Ensure no React Query mutations, no backend actor usage, and no fetch/XHR usage occur. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Remove all Tingi search wiring and unused Tingi-related frontend modules so the build contains no active Tingi search flow.",
      "acceptanceCriteria": [
        "frontend/src/components/TingiWidget.tsx is removed or replaced such that it no longer imports or uses useTingiSearch and no longer renders Tingi branding or search-related UI.",
        "frontend/src/hooks/useQueries.ts no longer exports useTingiSearch and is updated/cleaned up to avoid dead code related to Tingi search.",
        "frontend/src/hooks/useTingiConfig.ts is removed or updated so it is not referenced by the UI (and no longer mentions backend Google Custom Search credential handling).",
        "The frontend compiles without references to Tingi search types (e.g., TingiResponse) and without unused/empty placeholder search/humor modules being required at runtime."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove the Tingi search mutation (useTingiSearch) and any imports/types tied to Tingi search so no Tingi search logic remains in this hooks module."
        },
        {
          "path": "frontend/src/hooks/useTingiConfig.ts",
          "operation": "delete",
          "description": "Remove the unused Tingi configuration hook so it is not referenced by the UI and contains no credential/search-related language."
        },
        {
          "path": "frontend/src/lib/googleCustomSearch.ts",
          "operation": "delete",
          "description": "Remove the placeholder Google Custom Search frontend module so it cannot be accidentally imported or required at runtime."
        },
        {
          "path": "frontend/src/lib/tingiHumor.ts",
          "operation": "delete",
          "description": "Remove the placeholder Tingi humor module so it cannot be accidentally imported or required at runtime."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Render Piddu only within the unlocked + welcome-dismissed memories experience by swapping the widget in App shell at the existing gating point.",
      "acceptanceCriteria": [
        "frontend/src/App.tsx no longer imports/renders TingiWidget and instead imports/renders the new Piddu widget at the same gating point (unlocked + welcome dismissed).",
        "Piddu is not visible on the password gate screen or the welcome page screen.",
        "The rest of the site layout (header, hero, submission form, memory list, footer) remains unchanged aside from the widget swap."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the TingiWidget import/render with PidduWidget, keeping it rendered only in the existing unlocked + welcome dismissed branch. Ensure Piddu does not appear on PasswordGate or WelcomePage screens, and keep the rest of the layout unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}